In [1]:
%load_ext sql

In [2]:
from urllib.parse import quote_plus

password = quote_plus("pooja2005@#E")
connection_string = f"mysql+mysqlconnector://root:{password}@localhost/sql_notebook"

%sql {connection_string}

In [3]:
%%sql
use 100_usecases;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [4]:
%%sql
create table uber_rides(ride_id int primary key,customer_id int,customer_name varchar(50),city varchar(50),ride_date date,cancelled boolean);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [6]:
%%sql

INSERT INTO uber_rides VALUES
(1, 201, 'Mani', 'Chennai', '2025-04-01', FALSE),
(2, 201, 'Mani', 'Chennai', '2025-04-02', FALSE),
-- (add 48 more rows for Mani)
(51, 202, 'Ravi', 'Chennai', '2025-04-01', FALSE),
(52, 202, 'Ravi', 'Chennai', '2025-04-02', TRUE),
-- (add additional data for variety)
(100, 203, 'Arun', 'Coimbatore', '2025-04-01', FALSE);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
5 rows affected.

[]

In [7]:
%%sql
SELECT customer_id, customer_name, COUNT(*) AS total_rides
FROM uber_rides
WHERE city = 'Chennai' AND cancelled = FALSE
AND ride_date >= DATE_SUB(CURDATE(), INTERVAL 3 MONTH)
GROUP BY customer_id, customer_name
HAVING COUNT(*) >= 50;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [9]:
%%sql
CREATE TABLE zomato_orders (
order_id INT PRIMARY KEY,
customer_id INT,
customer_name VARCHAR(50),
order_date DATE,
amount DECIMAL(10,2));

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [10]:
%%sql
INSERT INTO zomato_orders VALUES
(1, 301, 'Karthik', '2025-04-04', 350.00),
(2, 301, 'Karthik', '2025-04-11', 420.00),
(3, 301, 'Karthik', '2025-04-18', 250.00),
(4, 301, 'Karthik', '2025-04-25', 500.00),
-- Fridays for May 2025
(5, 301, 'Karthik', '2025-05-02', 375.00),
(6, 301, 'Karthik', '2025-05-09', 410.00),
(7, 301, 'Karthik', '2025-05-16', 295.00),
(8, 301, 'Karthik', '2025-05-23', 460.00),
(9, 301, 'Karthik', '2025-05-30', 320.00),
-- Fridays for June 2025
(10, 301, 'Karthik', '2025-06-06', 390.00),
(11, 301, 'Karthik', '2025-06-13', 430.00),
(12, 301, 'Karthik', '2025-06-20', 280.00),
(13, 301, 'Karthik', '2025-06-27', 510.00),

(20, 302, 'Suresh', '2025-04-04', 300.00),
(21, 302, 'Suresh', '2025-04-18', 450.00),
-- Missing Fridays for Suresh
(22, 302, 'Suresh', '2025-04-11', 320.00),
(23, 302, 'Suresh', '2025-04-25', 390.00),
-- Fridays for May 2025
(24, 302, 'Suresh', '2025-05-02', 310.00),
(25, 302, 'Suresh', '2025-05-09', 400.00),
(26, 302, 'Suresh', '2025-05-16', 280.00),
(27, 302, 'Suresh', '2025-05-23', 450.00),
(28, 302, 'Suresh', '2025-05-30', 330.00),
-- Fridays for June 2025
(29, 302, 'Suresh', '2025-06-06', 370.00),
(30, 302, 'Suresh', '2025-06-13', 420.00),
(31, 302, 'Suresh', '2025-06-20', 310.00),
(32, 302, 'Suresh', '2025-06-27', 480.00),

(40, 303, 'Divya', '2025-04-05', 600.00);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
27 rows affected.

[]

In [12]:
%%sql
WITH fridays AS (
  SELECT DISTINCT DATE(order_date) AS order_date
  FROM zomato_orders
  WHERE DAYOFWEEK(order_date) = 6
    AND order_date >= DATE_SUB('2025-06-30', INTERVAL 3 MONTH)
),
customer_fridays AS (
  SELECT customer_id, customer_name, COUNT(DISTINCT DATE(order_date)) AS friday_orders
  FROM zomato_orders
  WHERE DAYOFWEEK(order_date) = 6
    AND order_date >= DATE_SUB('2025-06-30', INTERVAL 3 MONTH)
  GROUP BY customer_id, customer_name
),
total_fridays AS (
  SELECT COUNT(*) AS total_fridays FROM fridays
)
SELECT c.customer_id, c.customer_name
FROM customer_fridays c, total_fridays t
WHERE c.friday_orders = t.total_fridays;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
2 rows affected.

[(301, 'Karthik'), (302, 'Suresh')]

In [13]:
%%sql
CREATE TABLE amazon_orders (
order_id INT PRIMARY KEY,
customer_id INT,
customer_name VARCHAR(50),
product_id INT,
product_name VARCHAR(50),
order_date DATE
);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [14]:
%%sql
INSERT INTO amazon_orders VALUES
(1, 401, 'Priya', 1001, 'Bluetooth Speaker', '2025-04-02'),
(2, 401, 'Priya', 1001, 'Bluetooth Speaker', '2025-04-10'),
(3, 401, 'Priya', 1001, 'Bluetooth Speaker', '2025-04-20'),
(4, 401, 'Priya', 1001, 'Bluetooth Speaker', '2025-05-01'),
(5, 401, 'Priya', 1001, 'Bluetooth Speaker', '2025-05-15'),
(6, 402, 'Arjun', 1002, 'Wireless Mouse', '2025-04-05'),
(7, 402, 'Arjun', 1002, 'Wireless Mouse', '2025-06-01');

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
7 rows affected.

[]

In [16]:
%%sql
SELECT customer_id, customer_name, product_id, product_name, COUNT(*) AS purchase_count
FROM amazon_orders
WHERE order_date >= DATE_SUB('2025-06-10', INTERVAL 3 MONTH)
GROUP BY customer_id, customer_name, product_id, product_name
HAVING purchase_count >= 5;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[(401, 'Priya', 1001, 'Bluetooth Speaker', 5)]

In [17]:
%%sql
CREATE TABLE netflix_watch_history (
watch_id INT PRIMARY KEY,
user_id INT,
user_name VARCHAR(50),
movie_id INT,
movie_name VARCHAR(100),
watch_date DATE
);
INSERT INTO netflix_watch_history VALUES
(1, 501, 'Saravanan', 2001, 'Movie A', '2025-06-02'),
(2, 501, 'Saravanan', 2002, 'Movie B', '2025-06-03'),
(3, 501, 'Saravanan', 2003, 'Movie C', '2025-06-04'),
(4, 501, 'Saravanan', 2004, 'Movie D', '2025-06-05'),
(5, 501, 'Saravanan', 2005, 'Movie E', '2025-06-06'),
(6, 502, 'Divya', 2001, 'Movie A', '2025-06-02'),
(7, 502, 'Divya', 2002, 'Movie B', '2025-06-02');

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.
7 rows affected.

[]

In [11]:
%%sql
WITH week_data AS (
    SELECT
        user_id,
        WEEK(watch_date) AS watch_week,
        COUNT(DISTINCT movie_id) AS movie_count
    FROM netflix_watch_history
    WHERE watch_date >= DATE_SUB('2025-06-10', INTERVAL 4 WEEK)
    GROUP BY user_id, WEEK(watch_date)
)
SELECT user_id, COUNT(*) AS qualifying_weeks
FROM week_data
WHERE movie_count >= 5
GROUP BY user_id
ORDER BY qualifying_weeks DESC;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[(501, 1)]

In [13]:
%%sql
CREATE TABLE swiggy_orders (
order_id INT PRIMARY KEY,
customer_id INT,
customer_name VARCHAR(50),
order_date DATE,
cancelled BOOLEAN
);
INSERT INTO swiggy_orders VALUES
(1, 601, 'Meena', '2025-03-02', TRUE),
(2, 601, 'Meena', '2025-03-05', TRUE),
(3, 601, 'Meena', '2025-03-10', TRUE),
(4, 601, 'Meena', '2025-03-15', TRUE),
(5, 602, 'Ravi', '2025-04-03', TRUE),
(6, 602, 'Ravi', '2025-04-10', FALSE),
(7, 602, 'Ravi', '2025-04-18', TRUE);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.
7 rows affected.

[]

In [14]:
%%sql
SELECT customer_id, customer_name, DATE_FORMAT(order_date, '%Y-%m') AS cancel_month, COUNT(*) AS cancel_count
FROM swiggy_orders
WHERE cancelled = TRUE
GROUP BY customer_id, customer_name, DATE_FORMAT(order_date, '%Y-%m')
HAVING cancel_count > 3;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[(601, 'Meena', '2025-03', 4)]